Let و Const:

let: لتعريف متغير يمكن إعادة تعيين قيمته، وهو يشبه var ولكنه يملك نطاق محلي على مستوى الكتلة.
const: لتعريف متغير ثابت، لا يمكن إعادة تعيين قيمته.
الأسهم (Arrow Functions):

طريقة مختصرة لتعريف الدوال، كما أنها لا ترتبط بمفتاح this.
القوالب الحرفية (Template Literals):

تسهل إنشاء النصوص باستخدام العلامات `` (backticks)، وتسمح بإدراج التعبيرات باستخدام ${expression}.
فئات (Classes):

بناء نمطي لتعريف الفئات (classes) التي تشبه الفئات في لغات البرمجة الأخرى 







طرق جلب البيانات من API في JavaScript
استخدام Fetch API:

fetch طريقة حديثة لجلب البيانات من API باستخدام الوعود (promises).
استخدام XMLHttpRequest:

طريقة قديمة ولكنها ما زالت مستخدمة لجلب البيانات من API
استخدام مكتبة Axios:

مكتبة خارجية تسهل جلب البيانات من API باستخدام وعود (promises) وتوفر مزايا إضافية
